---
kind: property
id: P:Autodesk.Revit.DB.Structure.AnalyticalModelSelector.CurveSelector
source: html/193713c6-0b89-74b1-34cf-4947040cc059.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalModelSelector.CurveSelector Property

The portion of the curve to be selected.

## Syntax (C#)
```csharp
public AnalyticalCurveSelector CurveSelector { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration